#+TITLE:Hurd Cheatsheat
#+AUTHOR:Joshua Branson
#+LATEX_HEADER: \usepackage{lmodern}
#+LATEX_HEADER: \usepackage[QX]{fontenc}
#+OPTIONS: H:10 toc:nil

*** Capabilities
A capability is a process' right to perform various actions to another object.  A capability can be thought of as a car key.  The car key doesn't care who has the key.  If you have the key, then you can drive the car, listen to music, etc.

The Hurd has capabilities implemented as Mach ports.  BUT these ports are not persistent.  So when you reboot all those capabilities are lost.   To work around it, ACLs (Access Control Lists) are used to figure out who has permissions to do what.  For example my current home directory looks like

#+BEGIN_SRC sh :results output :dir ~/
ls -l
#+END_SRC

#+RESULTS:
#+begin_example
total 108
drwxr-xr-x  4 joshua home  4096 May 12 20:52 config-files
drwxr-xr-x  2 joshua home  4096 May 12 20:44 Desktop
drwxr-xr-x  3 joshua home  4096 Jun  8 14:55 documents
drwx------  2 joshua home  4096 Jun  5 22:18 Downloads
drwxr-xr-x 19 joshua home  4096 Jun  6 10:19 music
drwxr-xr-x  2 joshua home  4096 Jun  7 13:33 videos
#+end_example

Each node in the filesystem begins with lots of "r"s, "w"s, and "x"s.  These specify which users can read, write, or execute those nodes in the filesystem.

** Transferring files from host to qemu
Mounting Disk Image on Host

You may wish to mount your disk image on your host system to transfer files. To do this you will first need to find the offset of the partition you wish to mount.

#+BEGIN_SRC sh :results output :dir ~/programming/gnu/hurd/vm
 fdisk -l hd0.img
#+END_SRC

#+RESULTS:
#+begin_example
Disk hd0.img: 4 GiB, 4294967296 bytes, 8388608 sectors
Units: sectors of 1 * 512 = 512 bytes
Sector size (logical/physical): 512 bytes / 512 bytes
I/O size (minimum/optimal): 512 bytes / 512 bytes
Disklabel type: dos
Disk identifier: 0xb5b4d7a0

Device     Boot   Start     End Sectors  Size Id Type
hd0.img1           2048 7938047 7936000  3.8G 83 Linux
hd0.img2        7940094 8386559  446466  218M  5 Extended
hd0.img5        7940096 8386559  446464  218M 82 Linux swap / Solaris
#+end_example

Now take the number of sectors for the beginning of the partition and multiply it by the sector size. My / partition starts at sector 2048 and I have a sector size of 512 therefore my offset is 1048576.

# mount -o loop,offset=1048576 hd0.img /mnt/diskimage
